app/views/comments/_reply.html.erb

        Commentaire il y à <%= time_ago_in_words(comment.created_at) %>
        par <%= comment.user.first_name.capitalize! %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]