app/views/projects/partials/_project_registration_count.html.erb

	<span class="badge badge-pill badge-info">
		<%= @project.users.count %>
---
SELECT COUNT(*) FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ?  [["project_id", 2]]