app/views/projects/partials/_project_creator_card.html.erb

     		 <footer class="my-3">Project by: <cite title="Source Title">
      	 <%= "#{@project.user.first_name.capitalize!} #{@project.user.last_name.capitalize!}" %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]