app/views/projects/partials/_registration_button.html.erb

<% unless @project.users.include? current_user %>
---
SELECT  1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 2], ["id", 2], ["LIMIT", 1]]