app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <em>
             <%= "#{post.user.first_name.capitalize!} #{post.user.last_name.capitalize!}" %>