app/views/projects/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ?  [["project_id", 2]]
SELECT COUNT(*) FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ?  [["project_id", 2]]
---
							<span class="badge badge-pill badge-info">
								<%= @project.users.count %>

SELECT  1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 2], ["id", 1], ["LIMIT", 1]]
---
				<div class="col-md-12 my-3">
				<% unless @project.users.include? current_user %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
     		 <footer class="my-3">Project by: <cite title="Source Title">
      	 <%= "#{@project.user.first_name.capitalize!} #{@project.user.last_name.capitalize!}" %>