app/views/pages/partials/_projects.html.erb

            <em>
             <%= "#{post.user.first_name.capitalize!} #{post.user.last_name.capitalize!}" %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]