app/controllers/comments_controller.rb

INSERT INTO "comments" ("commentable_id", "commentable_type", "body", "user_id", "lft", "rgt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "comments" SET "lft" = CASE WHEN "lft" BETWEEN 2 AND 12 THEN "lft" + 14 - 12 WHEN "lft" BETWEEN 13 AND 14 THEN "lft" + 2 - 13 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 2 AND 12 THEN "rgt" + 14 - 12 WHEN "rgt" BETWEEN 13 AND 14 THEN "rgt" + 2 - 13 ELSE "rgt" END, "parent_id" = CASE WHEN "id" = 7 THEN 1 ELSE "parent_id" END, updated_at = '2018-02-17 10:41:50.247428' WHERE "comments"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."commentable_id" = ? AND "comments"."commentable_type" = ? AND ("comments"."lft" BETWEEN 2 AND 14 OR "comments"."rgt" BETWEEN 2 AND 14) ORDER BY "comments"."lft" ASC)  [["commentable_id", 1], ["commentable_type", "Project"]]
---
  def create
    commentable = commentable_type.constantize.find(commentable_id)
    @comment = Comment.build_from(commentable, current_user.id, body)

      if @comment.save