app/controllers/pages_controller.rb

SELECT "projects".* FROM "projects" ORDER BY created_at DESC
---
  def home
  	@projects = Project.all.order('created_at DESC')