app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "short_description", "pitch", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@project = current_user.build_project(project_params)
		if datetimevalidator($date_deadline)
			if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? ORDER BY "projects"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "projects" WHERE "projects"."user_id" IS NULL AND ("projects"."id" != ?) LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "projects" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2018-02-13 22:11:31.618447"], ["updated_at", "2018-02-13 22:11:31.618447"]]
---
	def new
		# associate user_id with a new project
		# a user ONLY has_one :project
		# a project belongs_to :user
		if Project.where(user_id: current_user.id).exists?
			flash[:danger] = "You can only create one project"
			redirect_to root_path
		else
			@project = current_user.create_project

UPDATE "projects" SET "video_url" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["video_url", " https://www.youtube.com/watch?v=gFEZ_oDMl6s"], ["updated_at", "2018-02-16 13:58:15.071973"], ["id", 1]]
---
	def update
		if datetimevalidator($date_deadline)
			if @project.locked
				flash[:danger] = $message_locked
				redirect_to show_project_path
			else
				if @project.update(project_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 2], ["id", 2], ["LIMIT", 1]]
---
	def project_creator_unregister_user
		if datetimevalidator($date_deadline)
			if @project.locked
				flash[:danger] = $message_locked
				redirect_to show_project_path
			else
				begin
					user = User.find(params[:user_id])
					if user.id != @project.user_id
						@project.users.destroy(user)
						flash[:success] = "Vous avez désinscris #{user.first_name.capitalize!} !"

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def find_project
		@project = Project.find(params[:id])